package main

import "strings"

var wordMap = map[string]string{
	"あ": "あんず", "い": "いんこ", "う": "うさぎ", "え": "えんぴつ", "お": "おおかみ",
	"か": "かえる", "き": "きんぎょ", "く": "くだもの", "け": "けいと", "こ": "ことり",
	"さ": "さんたくろーす", "し": "しょーとけーき", "す": "すかんく", "せ": "せいくらべ", "そ": "そぼろ",
	"た": "たくあん", "ち": "ちーず", "つ": "つみき", "て": "てーぶる", "と": "とうふ",
	"な": "なみのり", "に": "にんじん", "ぬ": "ぬりえ", "ね": "ねーぶる", "の": "のーと",
	"は": "はんぺん", "ひ": "ひまわり", "ふ": "ふるーつ", "へ": "へび", "ほ": "ほうとう",
	"ま": "まんもす", "み": "みかん", "む": "むぎわらぼうし", "め": "めきゃべつ", "も": "もみのき",
	"や": "やさい", "ゆ": "ゆびわ", "よ": "ようせい",
	"ら": "らいおん", "り": "りんご", "る": "るーれっと", "れ": "れもん", "ろ": "ろけっと",
	"わ": "わに", "を": "を", "ん": "ん",
	"が": "がんもどき", "ぎ": "ぎんなん", "ぐ": "ぐらのーら", "げ": "げんこつ", "ご": "ごきぶり",
	"ざ": "ざくろ", "じ": "じぐそーぱずる", "ず": "ずっきーに", "ぜ": "ぜんざい", "ぞ": "ぞんび",
	"だ": "だんご", "ぢ": "ぢ", "づ": "づ", "で": "でんきゅう", "ど": "どれみふぁ",
	"ば": "ばいく", "び": "びっくり", "ぶ": "ぶどう", "べ": "べっこうあめ", "ぼ": "ぼうし",
}

func buildReply(message string) (result string) {
	trimedMessage := strings.TrimSpace(message)
	runeMessage := []rune(trimedMessage)
	bodyMessage := string(runeMessage[0 : len(runeMessage)-1])
	lastLetter := string(runeMessage[len(runeMessage)-1:])

	if wordMap[lastLetter] != "" {
		result = bodyMessage + wordMap[lastLetter]
	} else {
		result = bodyMessage + lastLetter
	}
	return result
}
